def solution(A,B):
    answer = 0

    A.sort();
    B.sort(reverse=True);
    
    for i in range(len(A)):
        answer += A[i] * B[i]

    return answer

'''
정확성  테스트
테스트 1 〉	통과 (0.00ms, 10.1MB)
테스트 2 〉	통과 (0.04ms, 10.2MB)
테스트 3 〉	통과 (0.02ms, 10.1MB)
테스트 4 〉	통과 (0.02ms, 10.2MB)
테스트 5 〉	통과 (0.02ms, 10.1MB)
테스트 6 〉	통과 (0.02ms, 10.2MB)
테스트 7 〉	통과 (0.02ms, 10.3MB)
테스트 8 〉	통과 (0.04ms, 10.2MB)
테스트 9 〉	통과 (0.02ms, 10.2MB)
테스트 10 〉	통과 (0.04ms, 10.2MB)
테스트 11 〉	통과 (0.01ms, 10.2MB)
테스트 12 〉	통과 (0.01ms, 10.2MB)
테스트 13 〉	통과 (0.01ms, 10.2MB)
테스트 14 〉	통과 (0.01ms, 10.1MB)
테스트 15 〉	통과 (0.01ms, 10.2MB)
테스트 16 〉	통과 (0.01ms, 10.2MB)
효율성  테스트
테스트 1 〉	통과 (0.36ms, 10.3MB)
테스트 2 〉	통과 (0.23ms, 10.2MB)
테스트 3 〉	통과 (0.47ms, 10.3MB)
테스트 4 〉	통과 (0.25ms, 10.3MB)
채점 결과
정확성: 69.6
효율성: 30.4
합계: 100.0 / 100.0
'''